<!-- terraform-plan-comment -->
### 📦 Terraform Plan Result
```
module.lambda_trigger.data.archive_file.join_trigger_zip: Reading...
module.lambda_trigger.data.archive_file.join_trigger_zip: Read complete after 0s [id=944430d003963720d1934ccef4f12a8ccc35f8eb]
data.aws_availability_zones.available: Reading...
module.master_node_iam.aws_iam_role.master_node_ec2: Refreshing state... [id=master-node-role]
module.bootstrap_bucket.aws_s3_bucket.worker_node_token: Refreshing state... [id=k8s-bootstrap-artifacts]
aws_vpc.k8s: Refreshing state... [id=vpc-086e52a33a864ff2e]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.master_node_iam.aws_iam_role_policy.master_node_ec2_policy: Refreshing state... [id=master-node-role:master-node-role-policy]
module.master_node_iam.aws_iam_instance_profile.master_node_ec2_instance_profile: Refreshing state... [id=master-node-role-profile]
module.bootstrap_bucket.aws_s3_bucket_public_access_block.worker_node_token_access: Refreshing state... [id=k8s-bootstrap-artifacts]
aws_internet_gateway.k8s: Refreshing state... [id=igw-02524fe0cc2fa7c0a]
aws_subnet.public[1]: Refreshing state... [id=subnet-091c91645e010625b]
aws_subnet.public[2]: Refreshing state... [id=subnet-0e00b538d8010a536]
aws_subnet.public[0]: Refreshing state... [id=subnet-03db3655b617f6817]
aws_security_group.k8s: Refreshing state... [id=sg-01bf9bc28bfba67cd]
aws_route_table.k8s: Refreshing state... [id=rtb-0bd02e70a9a3f5884]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d3b36ef6c734995b]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-09cd4354b96a4dbdd]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07b4e6a9230757cb9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_trigger.aws_cloudwatch_event_rule.s3_trigger will be created
  + resource "aws_cloudwatch_event_rule" "s3_trigger" {
      + arn            = (known after apply)
      + description    = "Triggers Lambda when join-command.txt is uploaded"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + bucket = {
                      + name = [
                          + "k8s-bootstrap-artifacts",
                        ]
                    }
                  + object = {
                      + key = [
                          + "join-command.txt",
                        ]
                    }
                }
              + detail-type = [
                  + "Object Created",
                ]
              + source      = [
                  + "aws.s3",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "trigger-worker-join"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.lambda_trigger.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "trigger-worker-join"
      + target_id      = "TriggerLambda"
    }

  # module.lambda_trigger.aws_lambda_function.join_trigger will be created
  + resource "aws_lambda_function" "join_trigger" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "modules/lambda_trigger/join_worker_node.zip"
      + function_name                  = "trigger-worker-join"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "Qh2iGZnlQhDuRIA63ZJakybuoUUTo/j7sKVTdZxMPr0="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "S3_BUCKET" = "k8s-bootstrap-artifacts"
              + "S3_KEY"    = "join-command.txt"
            }
        }
    }

  # module.lambda_trigger.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "trigger-worker-join"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda_trigger_iam.aws_iam_instance_profile.master_node_ec2_instance_profile will be created
  + resource "aws_iam_instance_profile" "master_node_ec2_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "lambda-trigger-role-profile"
      + path        = "/"
      + role        = "lambda-trigger-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.lambda_trigger_iam.aws_iam_role.master_node_ec2 will be created
  + resource "aws_iam_role" "master_node_ec2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-trigger-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.lambda_trigger_iam.aws_iam_role_policy.master_node_ec2_policy will be created
  + resource "aws_iam_role_policy" "master_node_ec2_policy" {
      + id     = (known after apply)
      + name   = "LambdaTriggerPolicy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "ssm:SendCommand",
                          + "ssm:GetCommandInvocation",
                          + "ec2:DescribeInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.master_node_iam.aws_iam_role_policy.master_node_ec2_policy must be replaced
-/+ resource "aws_iam_role_policy" "master_node_ec2_policy" {
      ~ id     = "master-node-role:master-node-role-policy" -> (known after apply)
      ~ name   = "master-node-role-policy" -> "MasterNodePolicy" # forces replacement
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:ListObject",
                        ]
                      ~ Resource = "arn:aws:s3:::k8s-bootstrap-artifacts/*" -> [
                          + "arn:aws:s3:::k8s-bootstrap-artifacts/*",
                          + "arn:aws:s3:::k8s-bootstrap-artifacts/",
                        ]
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.worker_node_iam.aws_iam_instance_profile.master_node_ec2_instance_profile will be created
  + resource "aws_iam_instance_profile" "master_node_ec2_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "worker-node-role-profile"
      + path        = "/"
      + role        = "worker-node-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.worker_node_iam.aws_iam_role.master_node_ec2 will be created
  + resource "aws_iam_role" "master_node_ec2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "worker-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.worker_node_iam.aws_iam_role_policy.master_node_ec2_policy will be created
  + resource "aws_iam_role_policy" "master_node_ec2_policy" {
      + id     = (known after apply)
      + name   = "WorkerNodePolicy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:*",
                          + "ec2messages:*",
                          + "logs:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

Plan: 11 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```